In [4]:
5000050000 % (1e9+7)

49965.0

In [5]:
1e9

10000000000.0

In [16]:
import pandas as pd
pd.DataFrame({
    'name':['赵天姿','夏绍轩','贾冬妮','詹飞','总金额'],
    '用途':['版面费','会议注册费','差旅费','差旅费',''],
    '金额(元)':[1900,3500,2560+2307,2307,sum([1900,3500,2560+2307,2307])]
})

  name     用途  金额(元)
0  赵天姿    版面费   1900
1  夏绍轩  会议注册费   3500
2  贾冬妮    差旅费   4867
3   詹飞    差旅费   2307
4  总金额         12574